examples/eulerian_module_examples/E2_vortex_ring_flow/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  | Author: 2023, by Flavio A. C. Martins f.m.martins@tudelft.nl
\*---------------------------------------------------------------------------*/



FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "./meshing/cube.stl"

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

minCellSize         0.1;  // =================

maxCellSize         0.1; // =================

boundaryCellSize    0.1; // =================

// Stop meshing when it is not possible to capture all geometric features
enforceGeometryConstraints 1;

renameBoundary
{
    defaultType     patch;

    newPatchNames
    {
        "domain" { newName numericalBoundary; type  patch; }
        
    }
}

// ************************************************************************* //
